graph(%self : __torch__.gnn.___torch_mangle_15.GNN,
      %x.1 : Tensor,
      %edge_index.1 : Tensor,
      %edge_attr.2 : Tensor,
      %batch.1 : Tensor):
  %1619 : int[] = prim::Constant[value=[1]]()
  %1613 : int[] = prim::Constant[value=[0, 1, 3, 4]]()
  %1611 : Float(1, strides=[1], requires_grad=0, device=cpu) = prim::Constant[value={1}]()
  %43 : int = prim::Constant[value=-1]() # /Users/dvlpr/torch-mlir/examples/gnn/conv.py:94:37
  %layer.1 : int = prim::Constant[value=0]() # /Users/dvlpr/torch-mlir/examples/gnn/conv.py:75:8
  %layer.11 : int = prim::Constant[value=1]() # /Users/dvlpr/torch-mlir/examples/gnn/conv.py:81:41
  %layer.21 : int = prim::Constant[value=2]() # /Users/dvlpr/torch-mlir/examples/gnn/conv.py:75:8
  %layer.31 : int = prim::Constant[value=3]() # /Users/dvlpr/torch-mlir/examples/gnn/conv.py:75:8
  %layer.41 : int = prim::Constant[value=4]() # /Users/dvlpr/torch-mlir/examples/gnn/conv.py:75:8
  %36 : int = prim::Constant[value=8]() # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:29:48
  %35 : int = prim::Constant[value=7]() # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:28:48
  %34 : int = prim::Constant[value=6]() # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:27:48
  %30 : str = prim::Constant[value="expected 2D or 3D input (got {}D input)"]() # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:302:16
  %27 : bool = prim::Constant[value=1]() # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/sparse.py:81:11
  %24 : str = prim::Constant[value="builtins.ValueError"]() # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:44:22
  %23 : str = prim::Constant[value="Expected \'edge_index\' to be of integer type (got \'{}\')"]() # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:58:33
  %22 : str = prim::Constant[value="Expected \'edge_index\' to be two-dimensional (got {} dimensions)"]() # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:61:33
  %21 : str = prim::Constant[value="Expected \'edge_index\' to have size \'2\' in the first dimension (got \'{}\')"]() # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:64:33
  %20 : str = prim::Constant[value="Encountered tensor with size {} in dimension {}, but expected size {}."]() # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/conv/message_passing.py:246:17
  %16 : str = prim::Constant[value="The `dim` argument must lay between 0 and {} (got {})"]() # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:52:29
  %15 : str = prim::Constant[value="The `index` argument must be one-dimensional (got {} dimensions)"]() # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:46:29
  %6 : NoneType = prim::Constant()
  %self.graph_pred_linear.bias : Float(1, strides=[1], requires_grad=0, device=cpu) = prim::Constant[value={0.0364798}]()
  %self.graph_pred_linear.weight : Float(1, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.convs.4.bond_encoder.bond_embedding_list.2.weight : Float(2, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.convs.4.bond_encoder.bond_embedding_list.1.weight : Float(6, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.convs.4.bond_encoder.bond_embedding_list.0.weight : Float(5, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.convs.3.bond_encoder.bond_embedding_list.2.weight : Float(2, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.convs.3.bond_encoder.bond_embedding_list.1.weight : Float(6, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.convs.3.bond_encoder.bond_embedding_list.0.weight : Float(5, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.convs.2.bond_encoder.bond_embedding_list.2.weight : Float(2, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.convs.2.bond_encoder.bond_embedding_list.1.weight : Float(6, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.convs.2.bond_encoder.bond_embedding_list.0.weight : Float(5, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.convs.1.bond_encoder.bond_embedding_list.2.weight : Float(2, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.convs.1.bond_encoder.bond_embedding_list.1.weight : Float(6, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.convs.1.bond_encoder.bond_embedding_list.0.weight : Float(5, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.num_layer : int = prim::Constant[value=5]()
  %self.gnn_node.convs.0.mlp.1.training : bool = prim::Constant[value=0]()
  %self.gnn_node.convs.0.node_dim : int = prim::Constant[value=-2]()
  %self.gnn_node.convs.0.bond_encoder.bond_embedding_list.2.weight : Float(2, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.convs.0.bond_encoder.bond_embedding_list.1.weight : Float(6, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.convs.0.bond_encoder.bond_embedding_list.0.weight : Float(5, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.atom_encoder.atom_embedding_list.8.weight : Float(2, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.atom_encoder.atom_embedding_list.7.weight : Float(2, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.atom_encoder.atom_embedding_list.6.weight : Float(6, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.atom_encoder.atom_embedding_list.5.weight : Float(6, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.atom_encoder.atom_embedding_list.4.weight : Float(10, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.atom_encoder.atom_embedding_list.3.weight : Float(12, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.atom_encoder.atom_embedding_list.2.weight : Float(12, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.atom_encoder.atom_embedding_list.1.weight : Float(5, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.atom_encoder.atom_embedding_list.0.weight : Float(119, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %47 : Tensor = aten::slice(%x.1, %layer.1, %6, %6, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:21:51
  %48 : Tensor = aten::select(%47, %layer.11, %layer.1) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:21:51
  %50 : Tensor = aten::embedding(%self.gnn_node.atom_encoder.atom_embedding_list.0.weight, %48, %43, %self.gnn_node.convs.0.mlp.1.training, %self.gnn_node.convs.0.mlp.1.training) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/functional.py:2238:11
  %x_embedding.5 : Tensor = aten::add(%50, %layer.1, %layer.11) # <string>:5:9
  %54 : Tensor = aten::slice(%x.1, %layer.1, %6, %6, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:22:51
  %55 : Tensor = aten::select(%54, %layer.11, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:22:51
  %57 : Tensor = aten::embedding(%self.gnn_node.atom_encoder.atom_embedding_list.1.weight, %55, %43, %self.gnn_node.convs.0.mlp.1.training, %self.gnn_node.convs.0.mlp.1.training) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/functional.py:2238:11
  %x_embedding.9 : Tensor = aten::add_(%x_embedding.5, %57, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:22:8
  %61 : Tensor = aten::slice(%x.1, %layer.1, %6, %6, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:23:51
  %62 : Tensor = aten::select(%61, %layer.11, %layer.21) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:23:51
  %64 : Tensor = aten::embedding(%self.gnn_node.atom_encoder.atom_embedding_list.2.weight, %62, %43, %self.gnn_node.convs.0.mlp.1.training, %self.gnn_node.convs.0.mlp.1.training) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/functional.py:2238:11
  %x_embedding.13 : Tensor = aten::add_(%x_embedding.9, %64, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:23:8
  %68 : Tensor = aten::slice(%x.1, %layer.1, %6, %6, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:24:51
  %69 : Tensor = aten::select(%68, %layer.11, %layer.31) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:24:51
  %71 : Tensor = aten::embedding(%self.gnn_node.atom_encoder.atom_embedding_list.3.weight, %69, %43, %self.gnn_node.convs.0.mlp.1.training, %self.gnn_node.convs.0.mlp.1.training) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/functional.py:2238:11
  %x_embedding.17 : Tensor = aten::add_(%x_embedding.13, %71, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:24:8
  %75 : Tensor = aten::slice(%x.1, %layer.1, %6, %6, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:25:51
  %76 : Tensor = aten::select(%75, %layer.11, %layer.41) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:25:51
  %78 : Tensor = aten::embedding(%self.gnn_node.atom_encoder.atom_embedding_list.4.weight, %76, %43, %self.gnn_node.convs.0.mlp.1.training, %self.gnn_node.convs.0.mlp.1.training) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/functional.py:2238:11
  %x_embedding.21 : Tensor = aten::add_(%x_embedding.17, %78, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:25:8
  %82 : Tensor = aten::slice(%x.1, %layer.1, %6, %6, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:26:51
  %83 : Tensor = aten::select(%82, %layer.11, %self.gnn_node.num_layer) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:26:51
  %85 : Tensor = aten::embedding(%self.gnn_node.atom_encoder.atom_embedding_list.5.weight, %83, %43, %self.gnn_node.convs.0.mlp.1.training, %self.gnn_node.convs.0.mlp.1.training) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/functional.py:2238:11
  %x_embedding.25 : Tensor = aten::add_(%x_embedding.21, %85, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:26:8
  %89 : Tensor = aten::slice(%x.1, %layer.1, %6, %6, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:27:51
  %90 : Tensor = aten::select(%89, %layer.11, %34) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:27:51
  %92 : Tensor = aten::embedding(%self.gnn_node.atom_encoder.atom_embedding_list.6.weight, %90, %43, %self.gnn_node.convs.0.mlp.1.training, %self.gnn_node.convs.0.mlp.1.training) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/functional.py:2238:11
  %x_embedding.29 : Tensor = aten::add_(%x_embedding.25, %92, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:27:8
  %96 : Tensor = aten::slice(%x.1, %layer.1, %6, %6, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:28:51
  %97 : Tensor = aten::select(%96, %layer.11, %35) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:28:51
  %99 : Tensor = aten::embedding(%self.gnn_node.atom_encoder.atom_embedding_list.7.weight, %97, %43, %self.gnn_node.convs.0.mlp.1.training, %self.gnn_node.convs.0.mlp.1.training) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/functional.py:2238:11
  %x_embedding.33 : Tensor = aten::add_(%x_embedding.29, %99, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:28:8
  %103 : Tensor = aten::slice(%x.1, %layer.1, %6, %6, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:29:51
  %104 : Tensor = aten::select(%103, %layer.11, %36) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:29:51
  %106 : Tensor = aten::embedding(%self.gnn_node.atom_encoder.atom_embedding_list.8.weight, %104, %43, %self.gnn_node.convs.0.mlp.1.training, %self.gnn_node.convs.0.mlp.1.training) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/functional.py:2238:11
  %x_embedding.37 : Tensor = aten::add_(%x_embedding.33, %106, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:29:8
  %h_list.1 : Tensor[] = prim::ListConstruct(%x_embedding.37)
  %121 : Tensor = aten::__getitem__(%h_list.1, %layer.1) # /Users/dvlpr/torch-mlir/examples/gnn/conv.py:78:21
  %125 : Tensor = aten::slice(%edge_attr.2, %layer.1, %6, %6, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:48:54
  %126 : Tensor = aten::select(%125, %layer.11, %layer.1) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:48:54
  %128 : Tensor = aten::embedding(%self.gnn_node.convs.0.bond_encoder.bond_embedding_list.0.weight, %126, %43, %self.gnn_node.convs.0.mlp.1.training, %self.gnn_node.convs.0.mlp.1.training) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/functional.py:2238:11
  %bond_embedding.6 : Tensor = aten::add(%128, %layer.1, %layer.11) # <string>:5:9
  %132 : Tensor = aten::slice(%edge_attr.2, %layer.1, %6, %6, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:49:54
  %133 : Tensor = aten::select(%132, %layer.11, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:49:54
  %135 : Tensor = aten::embedding(%self.gnn_node.convs.0.bond_encoder.bond_embedding_list.1.weight, %133, %43, %self.gnn_node.convs.0.mlp.1.training, %self.gnn_node.convs.0.mlp.1.training) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/functional.py:2238:11
  %bond_embedding.10 : Tensor = aten::add_(%bond_embedding.6, %135, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:49:8
  %139 : Tensor = aten::slice(%edge_attr.2, %layer.1, %6, %6, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:50:54
  %140 : Tensor = aten::select(%139, %layer.11, %layer.21) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:50:54
  %142 : Tensor = aten::embedding(%self.gnn_node.convs.0.bond_encoder.bond_embedding_list.2.weight, %140, %43, %self.gnn_node.convs.0.mlp.1.training, %self.gnn_node.convs.0.mlp.1.training) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/functional.py:2238:11
  %edge_embedding.2 : Tensor = aten::add_(%bond_embedding.10, %142, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:50:8
  %147 : Tensor = aten::mul(%1611, %121) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:206:25
  %the_size.3 : int?[] = prim::ListConstruct(%6, %6)
  %149 : bool = prim::Uninitialized()
  %150 : bool = prim::isinstance[types=[Tensor]](%edge_index.1)
  %151 : bool, %152 : bool = prim::If(%150) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/sparse.py:63:4
    block0():
      %153 : int = prim::layout(%edge_index.1)
      %154 : bool = aten::eq(%153, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/sparse.py:64:11
      %155 : bool, %156 : bool = prim::If(%154) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/sparse.py:64:8
        block0():
          -> (%27, %27)
        block1():
          %157 : int = prim::layout(%edge_index.1)
          %158 : bool = aten::eq(%157, %layer.21) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/sparse.py:66:11
          %159 : bool, %160 : bool = prim::If(%158) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/sparse.py:66:8
            block0():
              -> (%27, %27)
            block1():
              %161 : int = prim::layout(%edge_index.1)
              %162 : bool = aten::eq(%161, %layer.41) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/sparse.py:68:11
              %163 : bool = prim::If(%162) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/sparse.py:68:8
                block0():
                  -> (%27)
                block1():
                  -> (%149)
              -> (%162, %163)
          -> (%159, %160)
      -> (%155, %156)
    block1():
      -> (%self.gnn_node.convs.0.mlp.1.training, %149)
  %164 : bool = prim::If(%151)
    block0():
      -> (%152)
    block1():
      -> (%self.gnn_node.convs.0.mlp.1.training)
  %165 : bool = prim::If(%164) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/sparse.py:81:11
    block0():
      -> (%27)
    block1():
      %166 : bool = prim::isinstance[types=[__torch__.torch_sparse.tensor.SparseTensor]](%edge_index.1)
      -> (%166)
   = prim::If(%165) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:42:8
    block0():
      %169 : int = aten::size(%edge_index.1, %layer.11) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:51:26
      %170 : int?[] = aten::_set_item(%the_size.3, %layer.1, %169) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:51:12
      %171 : int = aten::size(%edge_index.1, %layer.1) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:52:26
      %172 : int?[] = aten::_set_item(%the_size.3, %layer.11, %171) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:52:12
      -> ()
    block1():
      %173 : int = prim::dtype(%edge_index.1)
      %175 : bool = aten::__contains__(%1613, %173) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:57:15
      %176 : bool = aten::__not__(%175) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:57:15
       = prim::If(%176) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:57:12
        block0():
          %177 : int = prim::dtype(%edge_index.1)
          %178 : str = aten::format(%23, %177) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:58:33
           = prim::RaiseException(%178, %24) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:58:16
          -> ()
        block1():
          -> ()
      %179 : int = aten::dim(%edge_index.1) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:60:15
      %180 : bool = aten::ne(%179, %layer.21) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:60:15
       = prim::If(%180) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:60:12
        block0():
          %181 : int = aten::dim(%edge_index.1) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:62:42
          %182 : str = aten::format(%22, %181) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:61:33
           = prim::RaiseException(%182, %24) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:61:16
          -> ()
        block1():
          -> ()
      %183 : int = aten::size(%edge_index.1, %layer.1) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:63:15
      %184 : bool = aten::ne(%183, %layer.21) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:63:15
       = prim::If(%184) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:63:12
        block0():
          %185 : int = aten::size(%edge_index.1, %layer.1) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:66:37
          %186 : str = aten::format(%21, %185) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:64:33
           = prim::RaiseException(%186, %24) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:64:16
          -> ()
        block1():
          -> ()
      -> ()
  %the_size.5 : int? = aten::__getitem__(%the_size.3, %layer.1) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/conv/message_passing.py:241:19
  %196 : bool = aten::__is__(%the_size.5, %6) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/conv/message_passing.py:242:11
   = prim::If(%196) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/conv/message_passing.py:242:8
    block0():
      %198 : int = aten::size(%121, %self.gnn_node.convs.0.node_dim) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/conv/message_passing.py:243:24
      %199 : int?[] = aten::_set_item(%the_size.3, %layer.1, %198) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/conv/message_passing.py:243:12
      -> ()
    block1():
      %the_size.8 : int = prim::unchecked_cast(%the_size.5)
      %202 : int = aten::size(%121, %self.gnn_node.convs.0.node_dim) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/conv/message_passing.py:244:25
      %203 : bool = aten::ne(%the_size.8, %202) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/conv/message_passing.py:244:13
       = prim::If(%203) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/conv/message_passing.py:244:8
        block0():
          %205 : int = aten::size(%121, %self.gnn_node.convs.0.node_dim) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/conv/message_passing.py:246:49
          %207 : str = aten::format(%20, %205, %self.gnn_node.convs.0.node_dim, %the_size.8) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/conv/message_passing.py:246:17
           = prim::RaiseException(%207, %24) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/conv/message_passing.py:245:12
          -> ()
        block1():
          -> ()
      -> ()
  %index.2 : Tensor = aten::select(%edge_index.1, %layer.1, %layer.1) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:89:20
  %x_j.12 : Tensor = aten::index_select(%121, %self.gnn_node.convs.0.node_dim, %index.2) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:90:19
  %edge_index_i.2 : Tensor = aten::select(%edge_index.1, %layer.1, %layer.11) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:141:27
  %212 : int? = aten::__getitem__(%the_size.3, %layer.11) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:160:28
  %213 : bool = aten::__isnot__(%212, %6) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:160:28
  %size_i.2 : int? = prim::If(%213) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:160:17
    block0():
      %215 : int? = aten::__getitem__(%the_size.3, %layer.11) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:160:17
      -> (%215)
    block1():
      %216 : int? = aten::__getitem__(%the_size.3, %layer.1) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:160:53
      -> (%216)
  %220 : Tensor = aten::add(%x_j.12, %edge_embedding.2, %layer.11) # /Users/dvlpr/torch-mlir/examples/gnn/conv.py:30:22
  %out.2 : Tensor = aten::relu(%220) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/functional.py:1475:17
  %226 : bool = aten::__isnot__(%6, %6) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/aggr/base.py:150:11
  %out.6 : Tensor = prim::If(%226) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/aggr/base.py:150:8
    block0():
      %ptr.8 : Tensor = prim::unchecked_cast(%6)
      %229 : int = aten::dim(%out.2) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/aggr/base.py:151:45
      %232 : int = aten::add(%229, %self.gnn_node.convs.0.node_dim) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/aggr/base.py:186:19
      %ptr.14 : Tensor = prim::Loop(%232, %27, %ptr.8) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/aggr/base.py:186:4
        block0(%234 : int, %ptr.16 : Tensor):
          %ptr.18 : Tensor = aten::unsqueeze(%ptr.16, %layer.1) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/aggr/base.py:187:14
          -> (%27, %ptr.18)
      %237 : Tensor = torch_scatter::segment_sum_csr(%out.2, %ptr.14, %6) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_scatter/segment_csr.py:8:11
      -> (%237)
    block1():
      %238 : int = aten::dim(%edge_index_i.2) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:45:11
      %239 : bool = aten::ne(%238, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:45:11
       = prim::If(%239) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:45:8
        block0():
          %240 : int = aten::dim(%edge_index_i.2) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:47:37
          %241 : str = aten::format(%15, %240) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:46:29
           = prim::RaiseException(%241, %24) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:46:12
          -> ()
        block1():
          -> ()
      %244 : int = aten::dim(%out.2) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:49:14
      %245 : int = aten::add(%244, %self.gnn_node.convs.0.node_dim) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:49:14
      %246 : bool = aten::lt(%245, %layer.1) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:51:11
      %247 : bool = prim::If(%246) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:51:11
        block0():
          -> (%27)
        block1():
          %248 : int = aten::dim(%out.2) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:51:29
          %249 : bool = aten::ge(%245, %248) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:51:22
          -> (%249)
       = prim::If(%247) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:51:8
        block0():
          %250 : int = aten::dim(%out.2) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:53:32
          %251 : int = aten::sub(%250, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:53:32
          %252 : str = aten::format(%16, %251, %245) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:52:29
           = prim::RaiseException(%252, %24) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:52:12
          -> ()
        block1():
          -> ()
      %253 : bool = aten::__is__(%size_i.2, %6) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:55:11
      %dim_size.1 : int = prim::If(%253) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:55:8
        block0():
          %255 : int = aten::numel(%edge_index_i.2) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:56:47
          %256 : bool = aten::gt(%255, %layer.1) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:56:47
          %dim_size.7 : int = prim::If(%256) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:56:23
            block0():
              %258 : Tensor = aten::max(%edge_index_i.2) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:56:27
              %259 : int = aten::Int(%258) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:56:23
              %260 : int = aten::add(%259, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:56:23
              -> (%260)
            block1():
              -> (%layer.1)
          -> (%dim_size.7)
        block1():
          %dim_size.12 : int = prim::unchecked_cast(%size_i.2)
          -> (%dim_size.12)
      %262 : int[] = aten::size(%out.2) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:68:20
      %size.11 : int[] = aten::list(%262) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:68:15
      %264 : int[] = aten::_set_item(%size.11, %245, %dim_size.1) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:69:8
      %266 : int = aten::dim(%out.2) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:19:21
      %size.13 : int[] = aten::mul(%1619, %266) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:19:15
      %268 : int[] = aten::_set_item(%size.13, %245, %43) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:20:8
      %269 : Tensor = aten::view(%edge_index_i.2, %size.13) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:21:15
      %index.14 : Tensor = aten::expand_as(%269, %out.2) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:21:15
      %271 : Tensor = aten::new_zeros(%out.2, %size.11, %6, %6, %6, %6) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:74:19
      %272 : Tensor = aten::scatter_add_(%271, %245, %index.14, %out.2) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:74:19
      -> (%272)
  %273 : Tensor = aten::add(%147, %out.6, %layer.11) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmphecucm0z.py:206:25
  %self.gnn_node.convs.0.mlp.0.weight_fused_bn : Float(600, 300, strides=[300, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.convs.0.mlp.0.bias_fused_bn : Float(600, strides=[1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %input.6 : Tensor = aten::linear(%273, %self.gnn_node.convs.0.mlp.0.weight_fused_bn, %self.gnn_node.convs.0.mlp.0.bias_fused_bn) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/modules/linear.py:114:15
  %280 : int = aten::dim(%input.6) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:300:11
  %281 : bool = aten::ne(%280, %layer.21) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:300:11
  %282 : bool = prim::If(%281) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:300:11
    block0():
      %284 : bool = aten::ne(%280, %layer.31) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:300:32
      -> (%284)
    block1():
      -> (%self.gnn_node.convs.0.mlp.1.training)
   = prim::If(%282) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:300:8
    block0():
      %286 : str = aten::format(%30, %280) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:302:16
       = prim::RaiseException(%286, %24) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:301:12
      -> ()
    block1():
      -> ()
  %input.14 : Tensor = aten::relu(%input.6) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/functional.py:1475:17
  %self.gnn_node.convs.0.mlp.3.weight_fused_bn : Float(300, 600, strides=[600, 1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %self.gnn_node.convs.0.mlp.3.bias_fused_bn : Float(300, strides=[1], requires_grad=0, device=cpu) = prim::Constant[value=<Tensor>]()
  %h.1 : Tensor = aten::linear(%input.14, %self.gnn_node.convs.0.mlp.3.weight_fused_bn, %self.gnn_node.convs.0.mlp.3.bias_fused_bn) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/modules/linear.py:114:15
  %312 : int = aten::dim(%h.1) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:300:11
  %313 : bool = aten::ne(%312, %layer.21) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:300:11
  %314 : bool = prim::If(%313) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:300:11
    block0():
      %316 : bool = aten::ne(%312, %layer.31) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:300:32
      -> (%316)
    block1():
      -> (%self.gnn_node.convs.0.mlp.1.training)
   = prim::If(%314) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:300:8
    block0():
      %318 : str = aten::format(%30, %312) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:302:16
       = prim::RaiseException(%318, %24) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/modules/batchnorm.py:301:12
      -> ()
    block1():
      -> ()
  %result.6 : Tensor = aten::relu(%h.1) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/functional.py:1475:17
  %363 : Tensor[] = aten::append(%h_list.1, %result.6) # /Users/dvlpr/torch-mlir/examples/gnn/conv.py:90:12
  %364 : Tensor = aten::__getitem__(%h_list.1, %layer.11) # /Users/dvlpr/torch-mlir/examples/gnn/conv.py:78:21
  %368 : Tensor = aten::slice(%edge_attr.2, %layer.1, %6, %6, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:48:54
  %369 : Tensor = aten::select(%368, %layer.11, %layer.1) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:48:54
  %371 : Tensor = aten::embedding(%self.gnn_node.convs.1.bond_encoder.bond_embedding_list.0.weight, %369, %43, %self.gnn_node.convs.0.mlp.1.training, %self.gnn_node.convs.0.mlp.1.training) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/functional.py:2238:11
  %bond_embedding.14 : Tensor = aten::add(%371, %layer.1, %layer.11) # <string>:5:9
  %375 : Tensor = aten::slice(%edge_attr.2, %layer.1, %6, %6, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:49:54
  %376 : Tensor = aten::select(%375, %layer.11, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:49:54
  %378 : Tensor = aten::embedding(%self.gnn_node.convs.1.bond_encoder.bond_embedding_list.1.weight, %376, %43, %self.gnn_node.convs.0.mlp.1.training, %self.gnn_node.convs.0.mlp.1.training) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/functional.py:2238:11
  %bond_embedding.16 : Tensor = aten::add_(%bond_embedding.14, %378, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:49:8
  %382 : Tensor = aten::slice(%edge_attr.2, %layer.1, %6, %6, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:50:54
  %383 : Tensor = aten::select(%382, %layer.11, %layer.21) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:50:54
  %385 : Tensor = aten::embedding(%self.gnn_node.convs.1.bond_encoder.bond_embedding_list.2.weight, %383, %43, %self.gnn_node.convs.0.mlp.1.training, %self.gnn_node.convs.0.mlp.1.training) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/functional.py:2238:11
  %edge_embedding.4 : Tensor = aten::add_(%bond_embedding.16, %385, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/ogb/graphproppred/mol_encoder.py:50:8
  %390 : Tensor = aten::mul(%1611, %364) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:206:25
  %the_size.10 : int?[] = prim::ListConstruct(%6, %6)
  %393 : bool = prim::isinstance[types=[Tensor]](%edge_index.1)
  %394 : bool, %395 : bool = prim::If(%393) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/sparse.py:63:4
    block0():
      %396 : int = prim::layout(%edge_index.1)
      %397 : bool = aten::eq(%396, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/sparse.py:64:11
      %398 : bool, %399 : bool = prim::If(%397) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/sparse.py:64:8
        block0():
          -> (%27, %27)
        block1():
          %400 : int = prim::layout(%edge_index.1)
          %401 : bool = aten::eq(%400, %layer.21) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/sparse.py:66:11
          %402 : bool, %403 : bool = prim::If(%401) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/sparse.py:66:8
            block0():
              -> (%27, %27)
            block1():
              %404 : int = prim::layout(%edge_index.1)
              %405 : bool = aten::eq(%404, %layer.41) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/sparse.py:68:11
              %406 : bool = prim::If(%405) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/sparse.py:68:8
                block0():
                  -> (%27)
                block1():
                  -> (%149)
              -> (%405, %406)
          -> (%402, %403)
      -> (%398, %399)
    block1():
      -> (%self.gnn_node.convs.0.mlp.1.training, %149)
  %407 : bool = prim::If(%394)
    block0():
      -> (%395)
    block1():
      -> (%self.gnn_node.convs.0.mlp.1.training)
  %408 : bool = prim::If(%407) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/sparse.py:81:11
    block0():
      -> (%27)
    block1():
      %409 : bool = prim::isinstance[types=[__torch__.torch_sparse.tensor.SparseTensor]](%edge_index.1)
      -> (%409)
   = prim::If(%408) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:42:8
    block0():
      %412 : int = aten::size(%edge_index.1, %layer.11) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:51:26
      %413 : int?[] = aten::_set_item(%the_size.10, %layer.1, %412) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:51:12
      %414 : int = aten::size(%edge_index.1, %layer.1) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:52:26
      %415 : int?[] = aten::_set_item(%the_size.10, %layer.11, %414) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:52:12
      -> ()
    block1():
      %416 : int = prim::dtype(%edge_index.1)
      %418 : bool = aten::__contains__(%1613, %416) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:57:15
      %419 : bool = aten::__not__(%418) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:57:15
       = prim::If(%419) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:57:12
        block0():
          %420 : int = prim::dtype(%edge_index.1)
          %421 : str = aten::format(%23, %420) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:58:33
           = prim::RaiseException(%421, %24) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:58:16
          -> ()
        block1():
          -> ()
      %422 : int = aten::dim(%edge_index.1) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:60:15
      %423 : bool = aten::ne(%422, %layer.21) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:60:15
       = prim::If(%423) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:60:12
        block0():
          %424 : int = aten::dim(%edge_index.1) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:62:42
          %425 : str = aten::format(%22, %424) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:61:33
           = prim::RaiseException(%425, %24) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:61:16
          -> ()
        block1():
          -> ()
      %426 : int = aten::size(%edge_index.1, %layer.1) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:63:15
      %427 : bool = aten::ne(%426, %layer.21) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:63:15
       = prim::If(%427) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:63:12
        block0():
          %428 : int = aten::size(%edge_index.1, %layer.1) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:66:37
          %429 : str = aten::format(%21, %428) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:64:33
           = prim::RaiseException(%429, %24) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:64:16
          -> ()
        block1():
          -> ()
      -> ()
  %the_size.12 : int? = aten::__getitem__(%the_size.10, %layer.1) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/conv/message_passing.py:241:19
  %439 : bool = aten::__is__(%the_size.12, %6) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/conv/message_passing.py:242:11
   = prim::If(%439) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/conv/message_passing.py:242:8
    block0():
      %441 : int = aten::size(%364, %self.gnn_node.convs.0.node_dim) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/conv/message_passing.py:243:24
      %442 : int?[] = aten::_set_item(%the_size.10, %layer.1, %441) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/conv/message_passing.py:243:12
      -> ()
    block1():
      %the_size.14 : int = prim::unchecked_cast(%the_size.12)
      %445 : int = aten::size(%364, %self.gnn_node.convs.0.node_dim) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/conv/message_passing.py:244:25
      %446 : bool = aten::ne(%the_size.14, %445) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/conv/message_passing.py:244:13
       = prim::If(%446) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/conv/message_passing.py:244:8
        block0():
          %448 : int = aten::size(%364, %self.gnn_node.convs.0.node_dim) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/conv/message_passing.py:246:49
          %450 : str = aten::format(%20, %448, %self.gnn_node.convs.0.node_dim, %the_size.14) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/conv/message_passing.py:246:17
           = prim::RaiseException(%450, %24) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/conv/message_passing.py:245:12
          -> ()
        block1():
          -> ()
      -> ()
  %index.16 : Tensor = aten::select(%edge_index.1, %layer.1, %layer.1) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:89:20
  %x_j.14 : Tensor = aten::index_select(%364, %self.gnn_node.convs.0.node_dim, %index.16) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:90:19
  %edge_index_i.4 : Tensor = aten::select(%edge_index.1, %layer.1, %layer.11) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:141:27
  %455 : int? = aten::__getitem__(%the_size.10, %layer.11) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:160:28
  %456 : bool = aten::__isnot__(%455, %6) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:160:28
  %size_i.4 : int? = prim::If(%456) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:160:17
    block0():
      %458 : int? = aten::__getitem__(%the_size.10, %layer.11) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:160:17
      -> (%458)
    block1():
      %459 : int? = aten::__getitem__(%the_size.10, %layer.1) # /var/folders/fv/2kfwzrfd34g51h7_rsfb3pb00000gn/T/dvlpr_pyg/tmptk_cdwn5.py:160:53
      -> (%459)
  %463 : Tensor = aten::add(%x_j.14, %edge_embedding.4, %layer.11) # /Users/dvlpr/torch-mlir/examples/gnn/conv.py:30:22
  %out.9 : Tensor = aten::relu(%463) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch/nn/functional.py:1475:17
  %469 : bool = aten::__isnot__(%6, %6) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/aggr/base.py:150:11
  %out.10 : Tensor = prim::If(%469) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/aggr/base.py:150:8
    block0():
      %ptr.20 : Tensor = prim::unchecked_cast(%6)
      %472 : int = aten::dim(%out.9) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/aggr/base.py:151:45
      %475 : int = aten::add(%472, %self.gnn_node.convs.0.node_dim) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/aggr/base.py:186:19
      %ptr.22 : Tensor = prim::Loop(%475, %27, %ptr.20) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/aggr/base.py:186:4
        block0(%477 : int, %ptr.24 : Tensor):
          %ptr.26 : Tensor = aten::unsqueeze(%ptr.24, %layer.1) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/nn/aggr/base.py:187:14
          -> (%27, %ptr.26)
      %480 : Tensor = torch_scatter::segment_sum_csr(%out.9, %ptr.22, %6) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_scatter/segment_csr.py:8:11
      -> (%480)
    block1():
      %481 : int = aten::dim(%edge_index_i.4) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:45:11
      %482 : bool = aten::ne(%481, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:45:11
       = prim::If(%482) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:45:8
        block0():
          %483 : int = aten::dim(%edge_index_i.4) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:47:37
          %484 : str = aten::format(%15, %483) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:46:29
           = prim::RaiseException(%484, %24) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:46:12
          -> ()
        block1():
          -> ()
      %487 : int = aten::dim(%out.9) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:49:14
      %488 : int = aten::add(%487, %self.gnn_node.convs.0.node_dim) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:49:14
      %489 : bool = aten::lt(%488, %layer.1) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:51:11
      %490 : bool = prim::If(%489) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:51:11
        block0():
          -> (%27)
        block1():
          %491 : int = aten::dim(%out.9) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:51:29
          %492 : bool = aten::ge(%488, %491) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:51:22
          -> (%492)
       = prim::If(%490) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:51:8
        block0():
          %493 : int = aten::dim(%out.9) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:53:32
          %494 : int = aten::sub(%493, %layer.11) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:53:32
          %495 : str = aten::format(%16, %494, %488) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:52:29
           = prim::RaiseException(%495, %24) # /Users/dvlpr/mlir_venv/lib/python3.10/site-packages/torch_geometric/utils/scatter.py:52:12
          -> ()
        block1():
          -> ()
